<?xml version="1.0" encoding="UTF-8"?>
  <policy>
    <general>
      <name>%SELF_SERVICE_POLICY_NAME%</name>
      <enabled>true</enabled>
      <frequency>%SELF_SERVICE_POLICY_FREQUENCY%</frequency>
      <category>
        <name>%SELF_SERVICE_POLICY_CATEGORY%</name>
      </category>
    </general>
    <scope>
      <all_computers>true</all_computers>
      <exclusions>
        <computers/>
        <computer_groups>
           <computer_group>
              <name>%SELF_SERVICE_GROUP_EXCLUSION_1%</name>
           </computer_group>
           <computer_group>
              <name>%SELF_SERVICE_GROUP_EXCLUSION_2%</name>
           </computer_group>
            <computer_group>
              <name>%SELF_SERVICE_GROUP_EXCLUSION_3%</name>
           </computer_group>
           <computer_group>
              <name>%SELF_SERVICE_GROUP_EXCLUSION_4%</name>
           </computer_group>
           <computer_group>
              <name>%SELF_SERVICE_GROUP_EXCLUSION_5%</name>
           </computer_group>
           </computer_groups>
       </exclusions>
    </scope>
    <self_service>
      <use_for_self_service>true</use_for_self_service>
      <self_service_display_name>%SELF_SERVICE_DISPLAY_NAME%</self_service_display_name>
      <install_button_text>Install</install_button_text>
      <reinstall_button_text>Reinstall</reinstall_button_text>
      <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
      <force_users_to_view_description>true</force_users_to_view_description>
      <feature_on_main_page>%SELF_SERVICE_FEATURE_MAIN_PAGE%</feature_on_main_page>
      <self_service_categories>
        <category>
          <name>%SELF_SERVICE_POLICY_CATEGORY%</name>
          <display_in>true</display_in>
          <feature_in>%SELF_SERVICE_FEATURE_MAIN_PAGE%</feature_in>
        </category>
        <category>
          <name>%SELF_SERVICE_POLICY_CATEGORY_1%</name>
          <display_in>true</display_in>
          <feature_in>%SELF_SERVICE_POLICY_CATEGORY_FEATURE_1%</feature_in>
        </category>
        <category>
          <name>%SELF_SERVICE_POLICY_CATEGORY_2%</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
        <category>
          <name>%SELF_SERVICE_POLICY_CATEGORY_3%</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
        <category>
          <name>%SELF_SERVICE_POLICY_CATEGORY_4%</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
      </self_service_categories>
    </self_service>
    <package_configuration>
      <packages>
        <size>1</size>
        <package>
          <name>%pkg_name%</name>
          <action>Install</action>
        </package>
      </packages>
    </package_configuration>
    <maintenance>
       <recon>%SELF_SERVICE_POLICY_RECON%</recon>
    </maintenance>
    <dock_items>
      <size>1</size>
      <dock_item>
        <name>%DOCK_ITEM_NAME%</name>
        <action>%DOCK_ITEM_ACTION%</action>
      </dock_item>
    </dock_items>
    <user_interaction>
       <message_start>%SELF_SERVICE_USER_INTERACTION_START%</message_start>
       <message_finish>%SELF_SERVICE_USER_INTERACTION_FINISH%</message_finish>
    </user_interaction>
  </policy>